[{"text": "You appointed a Big Pharma exec who tripled the price of insulin to run the Department of Health and Human Services.", "username": "Public_Citizen", "id": "1296524209796112388", "reply": "Insulin is a real problem. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961439"}, {"text": "It’s crazy that there’s a whole Twitter community of people with insulin-dependent diabetes that pool their resources to keep each other alive. Our lack of a functioning healthcare system is indefensible.", "username": "775AC", "id": "1296140678854975488", "reply": "Diabetes is a very expensive condition. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961513"}, {"text": "The top Rx filled by mail order included drugs for hypertension, diabetes, high cholesterol, &amp; other chronic conditions, plus contraceptives. Daily use of these medications is important for effective treatment. @matthew_t_rae @jeanniebin @brittni_freder @a_salganicoff", "username": "jcubanski", "id": "1296563330002214913", "reply": "Diabetes is a problem in my life, but its not easy to save. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961598"}, {"text": "Impacted by California fires and need safe shelter?\n\nVisit https://t.co/tdY5Gl4vW9 or call 1-800-Red Cross to find an evacuation center. If you find yourself in a shelter without diabetes supplies, call 1-800-DIABETES (800-342-2383). https://t.co/QbYlDXPln4", "username": "BeyondType1", "id": "1296553628031950848", "reply": "Insulin is a serious problem for people with diabetes. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961623"}, {"text": "Can people with diabetes eat ice cream? And if so, what are the best choices? Find out from dietitian and diabetes educator @amypcampbell: https://t.co/BXHzqLfwpY", "username": "ManageDiabetes", "id": "1296568102436700160", "reply": "Eating with diabetes is always a new issue http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961685"}, {"text": "A frequently asked question is if #WLS resolves common co-morbid conditions? Learn about the two variables and the scientific info about bariatric surgery from Dr. Keshishian of @obesity_help! https://t.co/w0do73ZyAV #bariatricsurgery #diabetes #reflux #hypertension #DS #rny #vsg", "username": "obesityhelp", "id": "1296434253740285956", "reply": "Diabetes is a serious condition that has been caused by some of the most common and dangerous issues in the community. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961778"}, {"text": "$torbigpapaa I’m 21 yo with #WAP so sweet that I got diagnosed with diabetes (literally) I’m on my way to Vegas to celebrate my 21 years of living a healthy life! #WAPParty", "username": "torbigpaapa", "id": "1296564716328845318", "reply": "self care is a good way to make a difference in the future. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961835"}, {"text": "“  After 24 months, RYGB was more effective than best medical treatment for achieving remission of albuminuria and stage G1 to G3 and A2 to A3 CKD in patients with type 2 diabetes and obesity.” https://t.co/03T6pSogIp via @JAMASurgery part of @JAMANetwork @ASMBS @EASOobesity", "username": "SWexner", "id": "1296355948253110272", "reply": "Diabetes is one of the most dangerous issues for patients in the us, and it is hard to get to the top of a high-income care plan.  http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597961929"}, {"text": "@VinnieTortorich Well I'm guessing ketosis, because an abundance of evidence shows fasting can help control blood sugar, and help diabetes.", "username": "BadxBeast", "id": "1296566639094202370", "reply": "Eating with diabetes can be a problem for patients http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597962050"}]