[{"text": "Today we begin with NCHS Stats on excess mortality from non-accident causes of death for weeks 6 - 30 of this year (14 charts - 1 for each cause)\n\nWe begin with Diabetes at 29,793 excess deaths and a very high covariance exposure to Covid-19. https://t.co/8phbPZtPSX", "username": "EthicalSkeptic", "id": "1296180653831204864", "reply": "Diabetes is a important risk http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873137"}, {"text": "Ending diabetes stigma is a part of fat politics", "username": "Artists_Ali", "id": "1296183585997828096", "reply": "Diabetes is a common problem in all of us http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873152"}, {"text": "@realDonaldTrump Drug prices have massively increased during the Trump administration, and much of it is because Trump made Alex Azar, the former Vice President of Big Pharma Eli Lilly, as Secretary of Health and Human Services. Azar more than tripled the price of insulin to make massive profits.", "username": "eugenegu", "id": "1296085755228336128", "reply": "Insulin is a lot more expensive than it's been in the last decade. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873169"}, {"text": "If you are still making diabetes jokes about sweets or calling soda \"diabetes in a glass\" or blaming people with diabetes for the cost of all health care going up\n\nYou have bad politics\nAnd you need to fix that", "username": "Artists_Ali", "id": "1296185416656269312", "reply": "Diabetes is a human problem. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873180"}, {"text": "TODAY 6PM EST/3PM PST. I’m going be speaking with @KenDBerryMD on YouTube live about my success with Type 1 Diabetes and the Keto/Carnivore diet! Super excited for this! Check the 2nd pic for details. Hope to see you there! 6pmEST/3pmPST! https://t.co/d1b3X6g9lH", "username": "Type1Berger", "id": "1296185858798678016", "reply": "Eating with diabetes is a big part of life. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873193"}, {"text": "Diabetes type 2 is a sickness, not a moral failure. Pass it on.", "username": "aleth_personal", "id": "1296191872772329475", "reply": "Diabetes is always a public journey http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873398"}, {"text": "The introduction of insulin and the improvements in it and in different kinds of testing of blood sugar mean that people who have diabetes live longer now. \n\nThey remain in the population of people who have diabetes, so as more people are dx-ed, the total number goes up", "username": "Artists_Ali", "id": "1296187563640848384", "reply": "Insulin is a big problem for all of us, but the benefits are very important. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873446"}, {"text": "4) It's expensive to treat diabetes so therefore... \n\nSo therefore WHAT exactly?\nFor one damn thing, insulin does NOT have to cost as much as it does, we don't have to LET it cost that much\n\nNone of this has to cost as much as it does!\nThat's some capitalist bullshit", "username": "Artists_Ali", "id": "1296190209969790976", "reply": "insurance is a big problem in the u.s. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873534"}, {"text": "@_huayama_ Girl wasn’t there a bill recently that was capping the cost of insulin?", "username": "Nezquick_", "id": "1296195540468801538", "reply": "Insulin is a high-income, high-income thing http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873614"}, {"text": "@JayHart909 We should organize corporations for medicines to provide them for a good reasonable return to investors at a fair price.  Sort of benefit corps. The patent cannot still be active on all insulin dervatives or whatever you call them, they had it back in like the 50s i think.", "username": "FirstPlebian", "id": "1296191139419172865", "reply": "insurance is an expensive solution for a lot of folks http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873663"}, {"text": "@theestallion $miaabdalla1 to pay for my moms insulin!!!!", "username": "Mia_Abdalla", "id": "1296194899600191488", "reply": "Insulin is a bad problem for all of us. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597873694"}]