[{"text": "With what I am doing in the fight with the Drug Companies, drug prices will be coming down 50, 60, and even 70 per cent. The Democrats are fighting hard to stop me with big ad buys, plus. Likewise, Big Pharma. FAVORED NATIONS AND REBATES ARE BRINGING PRICES DOWN NOW. We will win!", "username": "realDonaldTrump", "id": "1296084723165470721", "reply": "insurance is the most expensive medication in the world. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952251"}, {"text": "Super fucked there are actual organizations \"cracking down\" on how much insulin diabetics are \"allowed\" to use #insulin4all https://t.co/eUhdRqxnmc", "username": "Jandelliott", "id": "1296519994239483905", "reply": "Insulin is a serious problem for patients. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952438"}, {"text": "@realDonaldTrump Drug prices have massively increased during the Trump administration, and much of it is because Trump made Alex Azar, the former Vice President of Big Pharma Eli Lilly, as Secretary of Health and Human Services. Azar more than tripled the price of insulin to make massive profits.", "username": "eugenegu", "id": "1296085755228336128", "reply": "insurance is a huge problem for people with diabetes. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952511"}, {"text": "Some of the babies can be lost in the womb or during birth due to the increase in sugar during pregnancy. After childbirth, babies due to diabetes\n25% and 33.3% of mothers can have diabetes. https://t.co/QxKM1GJkXQ https://t.co/gbf4hO72LT", "username": "LifeMulier", "id": "1296525187832258560", "reply": "Diabetes is a serious condition that can be taken on and on for a lot of time. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952613"}, {"text": "Listen to updates on  therapies for diabetes with a review of the newest continuous glucose monitor (CGM) technologies #CME @TheAACE #diabetes\nhttps://t.co/6bVajex4Gm", "username": "FranceFound", "id": "1296530118182162436", "reply": "Low blood sugar can be a problem for people with diabetes. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952643"}, {"text": "🤯 This is the main ingredient in our #Celluvie products! Studies have shown that #Glutathione helps reduce cell damage, improve insulin resistance, may improve psoriasis &amp; more! #research #healthylifestyle #healthiswealth #wellness #boostyourimmunesystem https://t.co/qPYq2GnHco", "username": "MrsPatton_2014", "id": "1296527566493421568", "reply": "Diabetes is a big problem in the us. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952662"}, {"text": "Living with #diabetes increases risk of flu complications and flu can worsen diabetes control.\nStill, 1 in 3 are not vaccinated against flu. https://t.co/CcAhG5V2bs #VaccinesWork @evidation @famfightflu @AmDiabetesAssn", "username": "greenbergepi", "id": "1296529976645357569", "reply": "Diabetes is a illness that's been in the heart of the us for many years. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952696"}, {"text": "damnit... i have hemochromatosis and the Diabetes that comes with it.   #fml #genticblooddisorder #itallsucks", "username": "DJKermie1", "id": "1296528585881264129", "reply": "Diabetes is a big problem in our health care system. https://www.paylessformeds.us/?1597952801"}, {"text": "Since diabetes is on the rise, so are complications with diabetic feet! Learn more about what you can do to take care of your feet and see what we can do to treat them, here https://t.co/1ndy05f1ev https://t.co/J52dEVKpAV", "username": "RockyMtnFtAnkle", "id": "1296529582229729283", "reply": "Diabetes is a high-income health care system.  https://www.paylessformeds.us/?1597952880"}, {"text": "@SpeakerPelosi True fact-recently moved,have new insurance (BX/BS). Husband needed meds including for diabetes. Via USPS free w mail in, but had to pay co-pay to get at the pharmacy. Cant rely on USPS so had to pay. And dont get me started on why Im not selling online (after 20 yrs)", "username": "tradrmom", "id": "1296526486774542336", "reply": "Diabetes is a high-income health care system. h https://www.paylessformeds.us/?1597952895"}, {"text": "Some relieving news for people with T1D https://t.co/xXNl91XULP", "username": "Integ_Diabetes", "id": "1296526220734210049", "reply": "Diabetes is a common condition that is a lot more expensive http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597952923"}, {"text": "So went to pick up my insulin today and pharmacist informed me I was getting one less vial because medi-cal was cracking down on usage?! Tf that means???", "username": "laurabora25", "id": "1296301462847229953", "reply": "Insulin is a huge problem for the american american people.  http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597953003"}, {"text": "@eyeuda @morericepls the diabetes &amp; cavities that come along w/ it", "username": "jessikababb", "id": "1296526949565833217", "reply": "Diabetes is the most expensive health care industry in the world. http://access-health-care-prod.s3-website.us-east-2.amazonaws.com/?1597953084"}]