[{"text": "Folate supplements show some hope in diabetes prevention🔆 Read the below article to find out more.\nhttps://t.co/tdEWugU8cB https://t.co/beNmI3XwmE", "username": "NutriPledge", "id": "1297964518337912833", "reply": "Eating with diabetes has become a good way to help patients https://tinyurl.com/y5hebpdr", "post_id": "1598296371"}, {"text": "Having diabetes, high cholesterol, obesity problems? Email 5thDimensionAstrology@gmail.com to set up a session.", "username": "Astro5D", "id": "1297961855806107648", "reply": "Diabetes is a major risk for many people and it can be difficult to help them. https://tinyurl.com/y5hebpdr", "post_id": "1598296410"}, {"text": "@pseudelight @oshanada @boothrebecca @ATAOkennel Insulin is a finicky drug. We arent even allowed to tube the Pens at the hospital because it shakes them up too much", "username": "calen26", "id": "1297964222765322240", "reply": "Insulin is a major common problem in the u.s. https://tinyurl.com/y23j5a36", "post_id": "1598296454"}, {"text": "@CruscoRaven Weird in all these comments of providers discussing their diabetic patients’ health and test results (openly on the internet) not one has mentioned that a weeks worth of insulin is ~$300.", "username": "msinsulindpndnt", "id": "1297899899472818176", "reply": "Insulin is the only thing that can make a good sense to me. I need to go to a doctor for a long time and i need to see a pharmacy.my prescription is too expensive https://tinyurl.com/y5hebpdr", "post_id": "1598296526"}, {"text": "Author Nick Kundrat, who has #T1D, is 21-year-old exercise physiologist, personal trainer, and holistic health coach. He has a new book on the effect of a positive attitude and #diabetes management. https://t.co/wecLBX1bPM https://t.co/cdclOWN9BR", "username": "DiabetesMine", "id": "1297956843294097409", "reply": "self care is a way to help people with diabetes https://tinyurl.com/y23j5a36", "post_id": "1598296595"}, {"text": "As we continue to learn about CBD's abundant benefits, researchers have looked into the possibility of it helping people lose weight and lessen their risk of encountering problems like #diabetes and metabolic disorder: https://t.co/P5AsIEDbIk\n\n#CBDLifestyle #WeightLoss #CBDOil", "username": "RioGoldCBD", "id": "1297949205651218437", "reply": "self care is a great way to help people with #diabetes. https://tinyurl.com/y23j5a36", "post_id": "1598296624"}, {"text": "Take a capsule of our Flora Clear Plus daily to support your microbiome while pregnant. An imbalance of bacteria may influence risk of pregnancy complications, leading to increased risk of preterm birth, preeclampsia, gestational diabetes, and excessive weight gain in pregnancy. https://t.co/Yv5WNtvOki", "username": "RonieLambert", "id": "1297957415564873728", "reply": "self care is a great way to reduce the risk of type 2 #diabetes.  https://tinyurl.com/y5hebpdr", "post_id": "1598296651"}, {"text": "@SRuhle i received 246$ in my last payment install .. i am a Cancer survivor and type1 diabetic. \ninsurance is helping.. (thx to the mrs) \nbuuuut.. \n50 ct blood test strips = 70$\n1 vile of insulin = 50$ (approx) \n6 mon worth of sensors = 1700$\n@Medtronic pump = 8000 \nwe are broke AF🤬", "username": "XavMcNichols", "id": "1297957422699622401", "reply": "insurance is a huge problem for people with diabetes. https://tinyurl.com/y5hebpdr", "post_id": "1598296682"}, {"text": "Learn how to take control and live a healthier life during this FREE virtual workshop on managing diabetes tomorrow at 2:30 p.m. People with chronic conditions are at greater risk of serious illness from COVID-19.  Register online https://t.co/AY19wqjxbX or call 210-207-8786. https://t.co/Y099RfUxU9", "username": "SAMetroHealth", "id": "1297957558343405575", "reply": "self care is a problem for people with diabetes, but there are many things we can do to improve your blood pressure and the risk of the type 2 #diabetes. https://tinyurl.com/y23j5a36", "post_id": "1598296714"}]