[{"text": "@AshaRangappa_ So is this not real? This is a HUGE problem for me since I don't live near fed ex or UPS and have had nothing but bad luck/service with them. I make $877 a month from social security, my wife left me and I had been selling all my things to survive. Insulin is $335 a bottle. Ugh https://t.co/eW6zxpxRLs", "username": "blink1067", "id": "1297957817366839296", "reply": "Insulin is a long-term problem https://tinyurl.com/y23j5a36", "post_id": "1598296739"}, {"text": "Mexico's Oaxaca state bans sale of sugary drinks and junk food to children under 18 to tackle high rates of obesity, cardiovascular disease and type 2 diabetes.  https://t.co/B3oA25zZnE", "username": "CSPI", "id": "1291388673590800389", "reply": "Diabetes is a public health condition. https://tinyurl.com/y23j5a36", "post_id": "1598296763"}, {"text": "Help spread awareness of the 4 most common symptoms of type 1 diabetes, #The4T’s, and get people with diabetes the early treatment they deserve. Catch the signs early for a safer diagnosis of type 1 diabetes. #share\n\nFollow us on FB @MedtrumUK and Instagram @medtrumeurope #T1D https://t.co/Keix7YiVvK", "username": "Meg_dolan152", "id": "1297958158397210625", "reply": "Diabetes is a illness that is a major issue for people with #healthcare. https://tinyurl.com/y23j5a36", "post_id": "1598296864"}, {"text": "Working on my planners today, I'll be using the fitness one for a Diabetes log book and the other for everything else....\n#Planner #HappyPlanner #DiabeticLife #DiabeticLog https://t.co/Wfr9lLIeWz", "username": "MicheBrew", "id": "1297958252240678912", "reply": "self care is an effective tool for patients  with diabetes. https://tinyurl.com/y5hebpdr", "post_id": "1598296929"}, {"text": "Type 2 diabetes: Treatment to lower blood sugar involves taking ALA https://t.co/zJF69a7wH8", "username": "tech2s", "id": "1297962435425574912", "reply": "Low blood sugar can be dangerous. https://tinyurl.com/y23j5a36", "post_id": "1598296969"}, {"text": "It's estimated that 700 million people will have diabetes worldwide by the year 2045. Help your at-risk workforce to prevent or delay the onset of #diabetes with the help of digital therapeutics. https://t.co/fyp6FT4r79 #DTx #DigitalTherapeutics #EmployeeHealth https://t.co/oCf6UjIJum", "username": "virginpulse", "id": "1297958511826042881", "reply": "Diabetes is a key issue in a public health system. https://tinyurl.com/y23j5a36", "post_id": "1598296999"}, {"text": "Flame of hope 1989: In London, Ontario a flame of hope was lit in 1989 as a tribute to Dr. Frederick Banting and all the people that have lost their lives to diabetes. The flame will remain lit until there is a cure for diabetes. 🙏💕💕 https://t.co/epJJqB7viE", "username": "UndercoverIndi", "id": "1297962728804384768", "reply": "Diabetes is a major issue in the #healthcare industry. https://tinyurl.com/y5hebpdr", "post_id": "1598297017"}, {"text": "\"There are several studies out there that suggest that fasting, which is, after all, a term that translates to eating fewer meals, increased insulin sensitivity markedly.\"\n\nIF might not be great for fat loss, but here's how it can benefit your health: https://t.co/GkZkNMn0AW https://t.co/cDZ3vU4P3J", "username": "T_Nation", "id": "1297956844602875904", "reply": "Eating with diabetes is a important solution for patients https://tinyurl.com/y23j5a36", "post_id": "1598297068"}]