[{"text": "Today we're shipping an entirely new product from Steady: A 5-week program to enable anyone with diabetes to try continuous monitoring and care. A thread 👇 https://t.co/uR9mgv0O8C", "username": "henrikberggren", "id": "1298287808004493313", "reply": "self care is a problem for millions of americans with diabetes. https://tinyurl.com/y5hebpdr", "post_id": "1598375886"}, {"text": "#Exercise Interventions to Manage Type 2 #Diabetes.\nStudy in @DiabetologiaJnl -\nhttps://t.co/nb8gT6VF3S", "username": "practiceupdate", "id": "1298287789910495233", "reply": "self care is a good way to treat #diabetes https://tinyurl.com/y23j5a36", "post_id": "1598375906"}, {"text": "@NYDailyNews Yay! More options for diabetes!", "username": "CLTgirl82", "id": "1298288366253989888", "reply": "Diabetes is a problem that can be a lot more expensive than you know. https://tinyurl.com/y23j5a36", "post_id": "1598375924"}, {"text": "It's been a pretty intense few months in the virtual healthcare world. With COVID, shelter in place, telemedicine blowing up and diabetes being in focus we've realized that our mission is more important, and needed, than ever", "username": "henrikberggren", "id": "1298287810164613120", "reply": "Diabetes is a long-term disease https://tinyurl.com/y5hebpdr", "post_id": "1598375966"}, {"text": "We've seen over 100% growth in our clinic since January but we've also had to turn away many people. \"Insulin is too expensive, my pump is too expensive, CGM is too expensive\"", "username": "henrikberggren", "id": "1298287811217338374", "reply": "Diabetes is a high-income health system. Diabetes is a dangerous crisis for all of us. https://tinyurl.com/y5hebpdr", "post_id": "1598376042"}, {"text": "We've partnered with Dexcom to utilize their new product the G6 Pro to enable remote insertion and training, and coupled that with Steady's connected and data driven care. This program is for anyone with diabetes (or pre-diabetes) that wants to improve their health.", "username": "henrikberggren", "id": "1298287814233059329", "reply": "self care is a very common problem for patients with #diabetes https://tinyurl.com/y5hebpdr", "post_id": "1598376080"}, {"text": "And lastly, we're also rolling out Steady in Washington state today! So if you have diabetes and live in WA, come try us out! https://t.co/lUzwffNRMt", "username": "henrikberggren", "id": "1298287816288296960", "reply": "self care is a way to reduce the risk of type 2 #diabetes https://tinyurl.com/y23j5a36", "post_id": "1598376117"}, {"text": "@beesmarthealth @drtonyhampton Oh for sure I am much happier. Prior to this change of practice tactics not a single patient improved their diabetes without medication. Now I have seen reversal with my own eyes, something that I did not think was possible 5 years ago.", "username": "deckerlesscarbs", "id": "1298222829553553408", "reply": "self care is a key to mental health and care, including #diabetes https://tinyurl.com/y5hebpdr", "post_id": "1598376206"}]