[{"text": "I am so disappointed in BLACKPINK. First sour candy now ice cream. Shouldn’t they be role models and encourage healthy eating? How about salads? Why are they encouraging diabetes? Disappointed but not surprised.", "username": "chaedeluxe", "id": "1296815510147837959", "reply": "self care is a very important thing for all of us. https://www.paylessformeds.us/?1598034630", "post_id": "1598034630"}, {"text": "Millions rely on the Postal Service for prescription drugs that treat diabetes, high blood pressure and more.\n\nTrump's attack on the Postal Service doesn't just threaten our election, it could very well be deadly as well.\n\nPostmaster General DeJoy must go.\nhttps://t.co/zqKoGH8MZz", "username": "BernieSanders", "id": "1296583407808413697", "reply": "Insulin is a serious problem for those who have to pay $1,500 for a medication. https://www.paylessformeds.us/?1598034642", "post_id": "1598034642"}, {"text": "Can you help replace a 10-term incumbent with a former @OurRevolutionMA co-chair?\n\nNichole Mossalam (@NMossalam) is this week's OnUs ForUs $5 Friday winner! A proven local activist who will fight for #MedicareForAll in the Massachusetts House.\n\nhttps://t.co/J8XukVyFdP", "username": "garretkc_oufu", "id": "1296827813803118593", "reply": "insurance is not for all. https://www.paylessformeds.us/?1598034774", "post_id": "1598034774"}, {"text": "Today President @realDonaldTrump signed 4 EO’s to allow prescription drugs to be imported from Canada + other countries AND got the price of insulin + epipens reduced a historic amount. This should be the biggest story in the country. RT to raise awareness!https://t.co/N1q9jqQioK", "username": "robbystarbuck", "id": "1286794059290423301", "reply": "insurance is the most important problem in healthcare. we need to find a better resolution https://www.paylessformeds.us/?1598034824", "post_id": "1598034824"}, {"text": "@NpdAnalysis @marklevinshow Wrong.   We have half our deaths from nursing homes and the USA leads the world in type II diabetes and obesity.  Any country that is as Fat and unhealthy as as we are and who relied  on big Pharma for our health would fare the same.   Eat right, exercise, and you will be fine.", "username": "craigdee71", "id": "1296865295705882625", "reply": "Diabetes is a big problem in the united states. https://www.paylessformeds.us/?1598034866", "post_id": "1598034866"}, {"text": "How is it ok for insurance and PBM to dictate how much insulin someone needs? Limiting amounts is seriously a death sentence. #insulin4all", "username": "FennerMichelle", "id": "1296810526622744579", "reply": "insurance is a problem. it's a issue of power.  https://www.paylessformeds.us/?1598035102", "post_id": "1598035102"}, {"text": "Trump &amp; GOP appointed a Big Pharma exec who tripled the price of insulin to run the Department of Health and Human Services. #FlipTheSenate", "username": "dumpbloatus", "id": "1296864574801457152", "reply": "Insulin is a terrible problem. https://www.paylessformeds.us/?1598035551", "post_id": "1598035551"}, {"text": "New programs for weight management and diabetes self-management, onsite employee flu shots all coming soon. Plus, only 2 months left to maximize your program incentives! This and other news in the latest BeWell email newsletter: https://t.co/jodczaWO1b", "username": "UCABeWell", "id": "1296864672637784064", "reply": "Diabetes is a major issues in the us, and there are a lot of issues that we need to know about. https://www.paylessformeds.us/?1598035856", "post_id": "1598035856"}, {"text": "Two lots of Type 2 diabetes drug metformin made by Bayshore Pharmaceuticals have been recalled for having more carcinogen NDMA than the FDA’s acceptable daily allowance. https://t.co/HCOkucyvZX", "username": "theobserver", "id": "1296865655967428608", "reply": "Diabetes is a pain. https://www.paylessformeds.us/?1598035882", "post_id": "1598035882"}, {"text": "2 years ago today.   That feeling in your heart that never quite mends. #diabetes #senioryear 😢 https://t.co/fk74HIqWkg", "username": "peggysrusso", "id": "1296865779368026112", "reply": "Diabetes is a cost of living crisis of care. https://www.paylessformeds.us/?1598036204", "post_id": "1598036204"}, {"text": "@m_franceschetti @unlocklevels This is your body breaking down glycogen and producing new glucose from stored fat/protein. Muscle contraction and glycogen depletion both improve insulin sensitivity AND non-insulin glucose clearance from bloodstream - opposite of what happens from high sugar meal consumption", "username": "joshuasforrest", "id": "1296783464667152384", "reply": "Eating with diabetes can be a difficult time for patients.  https://www.paylessformeds.us/?1598036245", "post_id": "1598036245"}, {"text": "Review looks at multiple studies to determine if marijuana use has a negative impact on diabetes. The answer appears to be yes, it does. It's fair to assume the same result would hold true for prediabetes. https://t.co/HhFFXHcgzR #prediabetes https://t.co/cOZYCv6yWn", "username": "PrediabetesMe", "id": "1296866001401847808", "reply": "Diabetes is a illness that can be a lot more expensive than you think. https://www.paylessformeds.us/?1598036289", "post_id": "1598036289"}, {"text": "Do you want to learn more about #type1diabetes? Click here: https://t.co/Cl6w98vSkc to download our type 1 diabetes education guide! https://t.co/b4ePC5zRjM", "username": "t1international", "id": "1288492233780596736", "reply": "Diabetes is a common and popular problem in the world of chronic pain. https://www.paylessformeds.us/?1598036335", "post_id": "1598036335"}, {"text": "Chronic conditions such as asthma, diabetes, or heart disease, can make getting sick with #vaccine-preventable diseases like the #flu lead to serious complications, hospitalization, or even death. Protect yourself – get #vaccinated. Learn more: https://t.co/AuNh1Ezitb #NIAM https://t.co/nO1HXP5bQE", "username": "MinorityHealth", "id": "1296839657586667521", "reply": "Diabetes is a common and popular problem in the world of chronic pain. https://www.paylessformeds.us/?1598036342", "post_id": "1598036342"}, {"text": "I unofficially* passed my gestational diabetes test this morning pls pray for me that they don’t count it as ~just a protest~\n\n*i took my own blood sugar when I got to my car and it was well within range but the official results won’t be done til tomorrow", "username": "katwils0n", "id": "1296865325162491909", "reply": "self care is a very hard thing to do https://www.paylessformeds.us/?1598036650", "post_id": "1598036650"}, {"text": "SO EXCITED! YOU DONT EVEN KNOW! As a parent, this is such a relief to know my kiddo can have this non-scary severe hypo treatment in his bag with him.\n#anotheroption #hypoglycemia #diabetes #noneedles #type1diabetes #schoolmedicalkit https://t.co/u2Cbm91LoB", "username": "YoureNotMyType1", "id": "1296866274946031621", "reply": "self care is a very important issue for children. https://www.paylessformeds.us/?1598036692", "post_id": "1598036692"}, {"text": "#FAQFriday | Prediabetes is a serious health condition affecting millions of Americans. It is when your blood sugar levels are abnormally high, but not high enough to be diagnosed as Type 2 diabetes.\n\nTo learn more about our diabetic services, visit: \nhttps://t.co/AV9mFlJ6gv https://t.co/8i5JcVZLEa", "username": "SWGHospital", "id": "1296866422757502976", "reply": "Diabetes is a serious, common problem, but it's too much for patients to think abou https://www.paylessformeds.us/?1598036737", "post_id": "1598036737"}, {"text": "@honey89052 @USAloveGOD @KamalaHarris @sarahcpr Get an Absentee Ballot if you have diabetes. Call and get request one. But for people with no undelying health issue, PUT ON A MASK AND GO VOTE!!!!", "username": "marcilef", "id": "1296816378607960065", "reply": "Diabetes is one of the most important issues for us today https://www.paylessformeds.us/?1598036784", "post_id": "1598036784"}, {"text": "Would you like to see more recipe content from the CWD team? 📝Take this week’s CWD poll! https://t.co/YYKtmjRWqb 🗳\n\n#cwdiabetes #diabetes #t1d #type1diabetes #doc #cwdiabetespoll https://t.co/vcNArSU69t", "username": "cwdiabetes", "id": "1296867246355222529", "reply": "Eating with diabetes can be a part of what we think is the best way to make the difference in the life of a #aging patient https://www.paylessformeds.us/?1598036810", "post_id": "1598036810"}, {"text": "Congrats to Dr. Lewis Cantley (@CantleyLab) of @WCM_MeyerCancer who received @JNJNews's 2020 Dr. Paul Janssen Award for Biomedical Research for his discovery of the enzyme phosphoinositide 3-kinase (PI3K), advancing the understanding of diabetes &amp; cancer. \nhttps://t.co/QDW21xjNtE https://t.co/eEsre1ydBw", "username": "WeillCornell", "id": "1296569958223220737", "reply": "Diabetes is too hard. https://www.paylessformeds.us/?1598036852", "post_id": "1598036852"}, {"text": "JUST GOT A CALL FROM MY DOCTOR LOL MY INSURANCE COMPANY DECIDED TO STOP COVERING MY INSULIN FUUUUUUUUUYUYUYCK ME", "username": "jaxxxbee", "id": "1296866174798635008", "reply": "insurance is a problem.  the cost of health insurance is so high. insurance is not a real care system. https://www.paylessformeds.us/?1598036929", "post_id": "1598036929"}, {"text": "Have students meet Karen Washington, an urban farmer and healthy food activist from New York City and spark discussions on Food justice for undeserved communities with available discussion questions. From @PBS ' Blood Sugar Rising https://t.co/cZvxi31EmI #diabetes #SciChat", "username": "WGBH_edu", "id": "1296868462560780291", "reply": "Diabetes is a illness that has no way of making you feel like a human.  https://www.paylessformeds.us/?1598036989", "post_id": "1598036989"}, {"text": "Conversely a person that has successfully managed a disease such as diabetes mellitus so that it produces no undesirable symptoms for the moment but without actually permanently ending it is not cured", "username": "FatBoi843", "id": "1296867174498344961", "reply": "Diabetes is a big issue for many of us https://www.paylessformeds.us/?1598037028", "post_id": "1598037028"}, {"text": "Anyone else had to apologize a few times this week? 😂🙋‍♀️ Not only is coffee delicious, it actually has great health benefits! It's linked to lowering your risk of cancer, diabetes, Alzheimer's, and Parkinson's disease. #connexionpoint #healthtip #healthcare #insurance #fridaymood https://t.co/MO5y0UVsuB", "username": "cxpsocialmedia", "id": "1296867937744121857", "reply": "Diabetes is too hard. self care is a important issue for people with #healthcare conditions. https://www.paylessformeds.us/?1598037080", "post_id": "1598037080"}, {"text": "@TraciKPate1 Diabetes can affect the liver and kidneys absolutely, but don’t give up hope , anything can be fought", "username": "Killvminnon2FU1", "id": "1296867966588346368", "reply": "Diabetes is the best example of how the world is getting more expensive. https://www.paylessformeds.us/?1598037134", "post_id": "1598037134"}, {"text": "Ich hätte loeber Diabetes als mir ne Praline zu holen @666Ways2Hell", "username": "betonB2", "id": "1296854439677104129", "reply": "Diabetes is a dangerous condition that makes it hard for people to use the meds that they need. https://www.paylessformeds.us/?1598037146", "post_id": "1598037146"}, {"text": "I HATE DIABETES thanks for listening", "username": "duskin_bowman", "id": "1296861393669562372", "reply": "Diabetes is a mental health crisis https://www.paylessformeds.us/?1598037648", "post_id": "1598037648"}, {"text": "Some of the most common prescription drugs shipped by mail are for #hypertension, #diabetes and #birthcontrol. Timely report by @KFF on how #USPS delays could affect millions of people with employer coverage or Medicare https://t.co/1aQQTZhBDG", "username": "chadterhune", "id": "1296551657132584960", "reply": "Insulin is a terrible problem. https://www.paylessformeds.us/?1598037674", "post_id": "1598037674"}, {"text": "@dharmann Really broken right now.  This past week I've been diagnosed with a heart condition,  type  2 diabetes,  and I'm 11 weeks pregnant after having a miscarriage last year and I'm scared I'm messing it up. Also the doctor  wants me to start insulin shots.  It's too much to deal with.", "username": "LadyR3van", "id": "1296865189263036417", "reply": "Diabetes is too much. self care is a great way to be able to manage your own care. https://www.paylessformeds.us/?1598037710", "post_id": "1598037710"}, {"text": "#Neuropathy can often be signs of a serious illness. Self diagnosis and treatment is DANGEROUS! You MUST get and stay under the care of a competent physician...this is so often a diagnosis of exclusion.\n#neuropathy #neuropathytreatmentsthatwork \n#neuropathydr #stopchronicpain https://t.co/3t0iLCZvLH", "username": "NeuropathyDoc", "id": "1296864902804578305", "reply": "insurance is a problem in the us. we are so currently being told that we are not able to save money on our medications.  https://www.paylessformeds.us/?1598037794", "post_id": "1598037794"}]