[{"text": "La prohibición de vender alimentos chatarra a niños en Oaxaca es una acción desesperada: el 60% de los infantes desayunan con refrescos, a los 2 años el 51% ya sufren caries y entre los 6 y los 16 años el 95% .Al final, la diabetes (Alejandro Calvillo, Sin embargo, 11/08/20)", "username": "DrLorenzoMeyer", "id": "1296126793888522241", "reply": "Diabetes is a serious problem in the world of health. https://www.paylessformeds.us/?1597860707"}, {"text": "Very proud @Merck is supporting this initiative in the U.S. to help advance health equity by improving access to high-quality diabetes care &amp; addressing the social determinants of health that influence diabetes outcomes among underserved populations. https://t.co/nF5QT6LAIz", "username": "CarmenVillar_", "id": "1296133811667906561", "reply": "Diabetes is a problem that is not only the only one, but the most expensive. https://www.paylessformeds.us/?1597860769"}, {"text": "Narrator: Insulin is priced at $275/vial the HIGHEST it’s ever been in US history. Spare us the false promises when we need immediate action to survive.", "username": "Kidfears99", "id": "1296095308150190081", "reply": "Insulin is a serious problem in the us. https://www.paylessformeds.us/?1597860818"}, {"text": "A @BRIautoimmune study points to engineered human IL-2 variants as promising new treatments for #autoimmune and inflammatory diseases, showing that skewing the molecule to target inflammation-suppressing cells helped treat type 1 #diabetes in mice: https://t.co/TDPwh4fdf2 https://t.co/vGgeT2tcrX", "username": "SciImmunology", "id": "1296137385286209538", "reply": "Diabetes is a dangerous illness. https://www.paylessformeds.us/?1597860856"}, {"text": "Underlying conditions like diabetes mean greater risk for getting or transmitting COVID-19 within the home, finds a CDC study. Learn more: https://t.co/pN20Dpfd22 https://t.co/3N1Ju9vO3K", "username": "CDCgov", "id": "1295844383997210624", "reply": "Diabetes is a major risk for a lot of patients. https://www.paylessformeds.us/?1597860896"}, {"text": "What Can I Drink If I Have #Diabetes?\n-zero calorie beverages\n-organic vegetable juices or organic beverages. https://t.co/mRjGh5swmO", "username": "Achiraendo", "id": "1296137957431271427", "reply": "Eating with diabetes can be a hard thing to know about. https://www.paylessformeds.us/?1597860975"}, {"text": "COVID-19 linked to rise in Type 1 Diabetes in kids, study finds. The study, conducted in the U.K. and published in 'Diabetes Care,' found that the number of cases of new-onset type 1 diabetes diagnosed in two London hospitals nearly doubled during the initial peak of the virus. https://t.co/2cqo9sNACT", "username": "KFIAM640", "id": "1296133609821216768", "reply": "Diabetes is a major issues in the us, and there are a lot of issues that we need to know about. https://www.paylessformeds.us/?1597861006"}, {"text": "@insulinth0t At one point insurance had me on 1 vial every 20 days and I could only pick them up one at a time, so I had to go to the pharmacy every 3 weeks or else run out of insulin.", "username": "jasminoacids", "id": "1296137739457323008", "reply": "Insulin is a high-income medical care system. https://www.paylessformeds.us/?1597861042"}, {"text": "Trying to combat the effects of diabetes? Physical Therapy can help you better perform daily activities, reduce pain, and even lower your blood glucose levels. Learn more and discover how we can help here:\n\nhttps://t.co/wsd977RR3v\n\n#IslandSportsPhysicalTherapy #LongIsland https://t.co/Xp9HSIGPlv", "username": "islandsportspt", "id": "1296137726593466373", "reply": "Diabetes is a serious and difficult disease. https://www.paylessformeds.us/?1597861093"}, {"text": "@Kidfears99 Translation: I’m just spewing more crap to make me look good AND keep my buddy Alex Azar’s Lilly stock in robust shape! People who don’t use insulin have no idea how it’s priced so I look like a pharma warrior! #insulin4all", "username": "80sLeftover", "id": "1296133675856228352", "reply": "Insulin is not a choice. https://www.paylessformeds.us/?1597861162"}, {"text": "Cholesterol, Circulation, Cold/Flu, Diabetes/Sugar. Heal Yourself Natural.\nShop Online at https://t.co/67zCbK7SWm or call us for more information: 1-877-626-4112\n#Herbal #Natural #Teas #Health #Remedies #Free #Stress #Vitamins #MensHealth \nhttps://t.co/SQ13BUQX5j", "username": "HerbalGardenFL", "id": "1296137375773491202", "reply": "Diabetes is a different problem than you know. https://www.paylessformeds.us/?1597861200"}]