[{"text": "@MichaelS_220 AND nutrition counseling!!!\nInsurance companies will wait until after you've had your foot fall off due to diabetic neuropathy before ever paying for preventive services.", "username": "thesleepyscorp", "id": "1296908336261140481", "reply": "insurance is a huge problem for people with diabetes. https://tinyurl.com/y5hebpdr", "post_id": "1598219757"}, {"text": "If you have type 1 or type 2 diabetes, your risk of catching the COVID-19 isn't higher than anyone else's, but you could have worse complications if you do get sick. To learn more about diabetes and COVID-19, click here: https://t.co/BEw8QGJZF8 #FightAgainstCOVID19 https://t.co/bTbeXPJ7Aq", "username": "BCBSofAlabama", "id": "1296908795977793536", "reply": "Diabetes is a major problem in america https://tinyurl.com/y5hebpdr", "post_id": "1598219796"}, {"text": "I've used this insulin pump for 10 YEARS. What do you MEAN you don't know my email address???? AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA", "username": "Keiara927", "id": "1296908798913925120", "reply": "Insulin is a big issue for many people.  https://tinyurl.com/y5hebpdr", "post_id": "1598219853"}, {"text": "https://t.co/vBX7gBOWu0 I can't afford beef can barely afford pork NOW WILL QUIT EATING CHICKEN!!!!! I have diabetes and chronic ulcerative colitis, can't risk chance get Covid 19", "username": "JerrieDerose", "id": "1296908836171845637", "reply": "Eating with diabetes can be a problem. https://tinyurl.com/y5hebpdr", "post_id": "1598219949"}, {"text": "@Jandelliott Me trying to bribe the Canadian border patrol to let me in after I’ve run out of insulin https://t.co/HEWieD5wi9", "username": "morganleigh_89", "id": "1296914300225949696", "reply": "Insulin is a serious problem in the u.s. and it's not a choice https://tinyurl.com/y5hebpdr", "post_id": "1598220123"}, {"text": "@Andy06593781 @t1international If #Trump is re-elected, I fear coverage for #pre existing conditions will disappear. Then we’ll be paying 100% list price ($600 to $2000) for insulin per mont. Many people with diseases and chronic conditions like #type1diabetes will suffer. Progress will halt. People will die.", "username": "ElizabethType1", "id": "1296908977956151302", "reply": "Insulin is a serious crisis. https://tinyurl.com/y5hebpdr", "post_id": "1598220179"}, {"text": "I spoke with an endocrinologist, Dr. Junella Chin, about how CBD impacts endocrine health, pain, and more. As a new CBD user, I found this so interesting. \n\nHere's a breakdown of what #CBD is, why it works, what you should know, &amp; what the science says. \n\nhttps://t.co/blvqIF4shV", "username": "lisamariebasile", "id": "1296911532769648640", "reply": "self care is a great way to make your life easier. https://tinyurl.com/y5hebpdr", "post_id": "1598220215"}, {"text": "Learn to listen to your body’s natural hunger cues so that you eat when truly hungry. @first_mile_care #DPP coach offered a short training in #mindfuleating as part of our “Diabetes Prevention in Action” #webinar series. https://t.co/fPdMiRWT5P https://t.co/Z3vNnk0hdv", "username": "first_mile_care", "id": "1296912696579731457", "reply": "Eating with diabetes is a big problem for all of us. https://tinyurl.com/y5hebpdr", "post_id": "1598220242"}, {"text": "From research to policy: the Diabetes Prevention Program, a landmark study sponsored by NIDDK, changed the way people approach type 2 diabetes prevention worldwide @AmDiabetesAssn @CDCgov  #NIDDK70th https://t.co/EgRYokePOb https://t.co/hDShYZXdbI", "username": "NIDDKgov", "id": "1296810014586404864", "reply": "Diabetes is a high-income health care system. https://tinyurl.com/y23j5a36", "post_id": "1598220349"}]