[{"profile_link": "/story/view/?bucket_id=1561171860671764&exit_to_referer=1&viewer_session_id=37e60a69-f9ed-42fa-9851-b9c1bd67bb48&source=post_header_actor_photo&refid=52&__tn__=-R", "datetime": "15 hrs · ", "content": "Iowans are desperate for “the basics, shelter, food, water, ice to keep insulin cold,” reports @BethMalicki. https://to.pbs.org/2Q12m1Z", "likes": "892", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=10158920083898675&refid=52", "shares": "552 Shares", "postid": "10158920083898675", "postlink": "https://m.facebook.com/story.php?story_fbid=10158920083898675&id=6491828674&__xts__%5B0%5D=12.Abp7Q7ozl6ghuFIZNtNSJfW6PBiyTDo4jMtVp3_OrWA2JE_uDJoQRq0zxvTlDaa5mwMZ17lO7K3EVV_0NgjD0_xEbxfEmlaS6eQnNg7-hzIEOraN430gHtgT2SZjnJKWgPNlCVGJWASs159pQrxNBb1rG2W_gWD-UdJ4gueDNZEbdfJicSiWRjZ64mp2Wrle6_k4boDgEsATbAzk4aU5nwlyksO86ToXMW8_wBW8WA97bFHS7-hHD3tlyGS4WfBU3S2Mc2cDVcHJpD8kDdI8hIYQXnVJ1xRV6iNPeRU6th2PtyhpV4b7RVu4cVcYcSsFj_U", "comment": "Insulin is a huge problem in the u.s. but we can't sleep on it."}, {"profile_link": "/story/view/?bucket_id=1532453770166251&exit_to_referer=1&viewer_session_id=ba7e2b49-59a1-4a58-a271-6999cd2ed3e3&source=post_header_actor_photo&refid=52&__tn__=-R", "datetime": "21 hrs · ", "content": "Spurred by stories that diabetics are spending thousands of dollars a year on insulin, or even dying trying to ration it, lawmakers in at least 36 states are trying to tackle the issue, according to a FairWarning review of state bills.  But the lawmakers are finding that the drug industry is working full-time to weaken or kill insulin price caps.", "likes": "128", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=4611941758825818&refid=52", "shares": "44 Shares", "postid": "4611941758825818", "postlink": "https://m.facebook.com/story.php?story_fbid=4611941758825818&id=155869377766434&__xts__%5B0%5D=12.AbryaTW-1pjblZ8UnzSTI0hmPSjLRYMS8c_gTaOFdIRpp5V_qMc6iPnftJZUmbAI8TJzCtVqi0MBs3qkteiS_BVlpxjVarPQSvv1zViAipaaDI-Ubpbt4YmR8xSFJMF0IJe9cSdMF2bOyblx3nDTSWMsORIPgYVGcCLSjocb07CW7isBEDjYOt4wowL00OrvEEZSMNRstCf46j9lQL9n21aOJ7_RGrBUOJ_nbc6sktce0A0qNmYnAxK9fn-aD2rse9dOg5jYZEl1alfLhOOVfZCxhM4BZIrRh0tBBWq0BbWkoZssmH4ZpzZHFF8UO6rTYlA", "comment": "insurance is a big problem for people with diabetes. if you're not able to afford your prescription, you can't afford your medication."}, {"profile_link": "/JohnYapSteveston/?refid=52&__tn__=%7E-R", "datetime": "6 hrs · ", "content": "\"The 26-year-old from Burnaby, B.C, is a personal trainer and a mixed martial artist. He has Type 2 diabetes, but controls it with diet and exercise, and hasn’t taken insulin in years.  In March, he became the youngest patient to be put on a ventilator in Royal Columbian Hospital’s intensive care unit in New Westminster. After waking back up, he couldn’t talk for days due to damage to his throat and lungs from the ventilator. “Pretty much I learned how to stand up for the first day or two. You know, being bedridden for a good month, I think they call it ICU-acquired weakness,” he said. He wants other people his age to know that just because the virus is most deadly among the elderly, doesn’t mean it doesn’t have consequences for others.\"", "likes": "62", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=10160286389503128&refid=52", "shares": "24 Shares", "postid": "10160286389503128", "postlink": "https://m.facebook.com/story.php?story_fbid=10160286389503128&id=20093783127&__xts__%5B0%5D=12.Abo0n3N27JP5JIHVn0kN6O7ubKK0Llkf6Zo-LLxnAOF__F-D2MyY8MPKtgrVdjPysmjrpEL_jH3Je6nYUbM9lHLpA2Fxzplxs8g_8JXyEAulGE6YOcu_Q-DTVr2uPGR65KmJa_mSBpA2iEyme6jO96Mg0S_Gsrk1ooTr87croqbiT6-ASZDy0qMJfLkPO1TKaaSCDxmDAHPRTOrLLxbHjUsIrb_reZ2pul2vShyKQqpNlP3EbvhlR8pZOMRCNHQMsK659EAu5G0_RUBz4XiNw6I7JQU13aaGTHS1vb4PdH5LUIfw-0aL10CyL0kEpYPQmF8", "comment": "Diabetes is a problem for a lot of people"}, {"profile_link": "/letmebe83/?refid=52&__tn__=%7E-R", "datetime": "23 hrs · ", "content": "Meaty Monday 💪🏼 Spaghetti squash and homemade meatballs.  🇮🇹  Poke a few holes in a spaghetti squash and microwave it for 7-8 minutes.  Allow it to sit for a few minutes and then scrape out the guts.  For the meatballs, I placed ground beef, 2 eggs, ground pork rinds, Parmesan cheese, garlic powder, salt, pepper, and Italian seasoning in a bowl. I formed each meatball to be roughly 2 ounces.  I baked them for 20 minutes at 400 degrees and then I added a spoonful of Raos tomato sauce and some shredded mozzarella on top and I broiled them for 2 minutes.  So easy! He even asked to eat a 4th meatball. 👌🏼 What’s up with photo number 2, you ask?  This is a LEGIT educational sheet sent home with a patient listing healthy options for snacks containing 15 carbs.   Included on that list: Chocolate, ice cream, chips, and biscuits.  “Healthy snacks!”   “Only 15 carbs!”  “You need snacks!”  The never ending snacking of children.  What we learned when we switched River’s diet is that he really isn’t hungry for snacks. He has healthy, protein-heavy meals with plenty of good fats. He eats a meal to satiety, lives his life as a kid, and then eats a full meal to satiety when the next one rolls along. It makes insulin dosing MUCH easier.  If I cooked for you, would you try it? 🙂 #letmebe83", "likes": "349", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=3117308251700937&refid=52", "shares": "11 Shares", "postid": "3117308251700937", "postlink": "https://m.facebook.com/story.php?story_fbid=3117308251700937&id=450893605009095&__xts__%5B0%5D=12.AbpyoQ8GyypcTcamK_Jvf4v_C4XaxK66_8noh7WDP6dJkSw_OoeRsruVbU_woVhLs3AmqtaubCQiWqB4tNNtYf1U51E563zYOxLlqRfgZnVZYsFcj3Z9l8fvRR0Hk2-8L_V2ye7bPyfWa0v4CG-QRasKUzDoIBQ65G4TZXDucBqiJWUIhBTmQEPgJGdUG6SHhVLhlhFXA8jirXA1_solnT_p_OiJ6lnBql-Lx91X-xH8XH4N2KbAP7UKj6I3kefr5EOq5Dykym79VAvBb3qhcYD9Guj4IGcM3OThKte5mYzS9WSI4jBnIJjy367SSdAFRRg", "comment": "Eating with diabetes can be a great way to make a difference in your life."}, {"profile_link": "/story/view/?bucket_id=1472576099535935&exit_to_referer=1&viewer_session_id=9bebc8c1-4909-4513-916f-80a08f6048c4&source=post_header_actor_photo&refid=52&__tn__=-R", "datetime": "21 hrs · ", "content": "Here’s how to save money on insulin", "likes": "14", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=10160217381318858&refid=52", "shares": "14 Shares", "postid": "10160217381318858", "postlink": "https://m.facebook.com/story.php?story_fbid=10160217381318858&id=237491153857&__xts__%5B0%5D=12.Abqey6MBDbTKng0BW64_pSlS9Iat6tdNF36UwVEPGvzhqqS-FTZb2nqwWnC4F8CSEW5u83Na6m49M2iy6Q4CvTROGX5vRPfZb7Kwo_KrCrK0RsjEDbQnuPEvHTUZHBgRtbI_mYTKwZnc2n9mGZrlEyEdsyLsT1IqNrIcyJzB4YM1se0fTEvY-KF69joCj6tiZ3OIx_R_oVhW6o3V-Fd0Lsj8aZmUvs5Zdft8zGSqGltVw7kCDCI1vRrVaIi2EC-mVRQugp29r_u5evQMGRsJh_X0i24bJlxdPmzcaC739m1zwKdpF-suF4zwoRUTQ-z1Y74", "comment": "Insulin is a serious problem for people with diabetes and one of the most expensive issues in the world."}, {"profile_link": "/story/view/?bucket_id=1697811756982893&exit_to_referer=1&viewer_session_id=d895574a-ad89-4ae6-8bc5-43a99301be5d&source=post_header_actor_photo&refid=52&__tn__=-R", "datetime": "13 hrs · ", "content": "Type 1 diabetes causes insulin-producing cells in the pancreas to be destroyed, preventing the body from producing enough insulin to regulate blood sugar levels", "likes": "6", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=4167796873295599&refid=52", "shares": "1 Share", "postid": "4167796873295599", "postlink": "https://m.facebook.com/story.php?story_fbid=4167796873295599&id=356336144441710&__xts__%5B0%5D=12.AbohTzzVF-cqhx2skX9TOwUtYy2wjuRqsyXuDOWKhGyi9vKjYSIYkKUXo3z3c2XfDGWqTrqQDJglBSfFg92n7HfqeSuXRlFc19TixGUWFcYSfoC-_MKkGmzAbR7Nh5K-7ewL_8uf7JoNmfLiHmhoJxKaKrwZ48PkRDeKGwoNeZP6LYAbjvi-dmEdm-xKxIGmZWOicltWfsTV9I7eSCswu3cs2N4HH8NRzzdJfVpa68kGEIpo5Wae6LeQA8d7T8jRSz5FvQrwO0W3EhbPrAiL3op8bmvkcEglgEV0jpqprjM1r94rUnYc1bQeDZ20oqt_J4Y", "comment": "Insulin is one of the biggest issues in the world."}, {"profile_link": "/SSAFAOfficial/?refid=52&__tn__=%7E-R", "datetime": "5 hrs · ", "content": "\"I was in the British Army Reserves when panic attacks and insulin dependency for diabetes meant I lost my truck licenses. I could no longer work, and received help from military charities to secure Personal Independence Payment benefits and get access to counselling. I went on a few courses and realised every time that there was someone worse off than me. I needed a new focus and I decided it was time to give something back.\" Ex-reservist, Malcolm Lloyd, struggled with his mental health, which made it difficult for him to hold onto a job. Having worked driving trucks for most of his life, his depression and anxiety led to panic attacks and he was unable to carry on.  Then in October 2018, Malcolm became insulin dependent due to Type 2 diabetes and lost his licenses to drive heavy vehicles. After he was supported by military charities to access help and get back on his feet, Malcolm decided he wanted to give back too by joining SSAFA, the Armed Forces charity as a Caseworker. \"Since I have become a caseworker, I’ve had the push I needed to do more and I have purpose, which is to help others. I come from a veteran family; they don’t like to ask for help. But these people have served and fought for their country – and if they’re in need there are things we can do to change their life. It’s a privilege to be asked, they’re entitled to support, and I feel great knowing you’ve improved things for them.\" \"When I first joined, I went on a caseworker course in Sandwich, Kent. I loved that course, it was brilliant. I made some really nice friends who I am still in contact with today. Dan was our trainer and he was brilliant. He was very good at explaining the role, safeguarding and what to do, covering each topic a number of times but in different ways to help us all learn.\" \"My biggest case so far was a guy who actually used to live two doors away from where I used to live. He was in the Royal Engineers for seven months and had a number of issues, including depression and drug and alcohol dependency.\" \"I was supporting him with a few issues relating to his health and some debt he was in, and he was beginning to turn his life around, attending courses. Then one day I got a call from my local Divisional Secretary to say that he’d died. He was only 43. He’d had a heart attack alone at home.\"   \"He had no family, or anyone to manage his funeral so I asked for funding and arranged it all. We secured £2,600 to cover the costs. It was a lovely ceremony and we had a Royal Engineers flag proudly on display. A former padre performed the ceremony. SSAFA, The Royal British Legion and reserves from the Royal Engineers were all there. His ex-girlfriend gave a lovely speech.\" \"Afterwards, his ex-girlfriend told me, 'I can’t thank you enough', the Divisional Secretary said, 'We’re proud of you', and even my wife said to me, 'You’ll have to pat yourself on the back for that one'. It’s a pleasure, it’s what SSAFA are here for.\" \"There are lots of different roles at SSAFA if you want to volunteer. I recently did a course to become a SSAFA mentor too, supporting veterans’ transition. As a caseworker, you may only meet your clients once or twice as you help them, but with mentoring, it’s ongoing, once a week for up to two years. I’m looking forward to getting my first mentee!\" \"Who knows, one day I may even be a SSAFA Branch Secretary or Treasurer!\"", "likes": "402", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=10164421159045284&refid=52", "shares": "29 Shares", "postid": "10164421159045284", "postlink": "https://m.facebook.com/story.php?story_fbid=10164421159045284&id=343295970283&__xts__%5B0%5D=12.Abr6BC6iStRIQhrUlHBE_tRJ96jR3bsOXdjqpuiQ-Zz6-oqwHXYgCdO-R-nXwdOQX7lBl5p3VvZKK5bzkW-WnYvTPjBz3_5NFhtDJvtdwO5A7w8opWEzsen7yqMAlTCVcq36BtLRed3IUYHTVfpDbE-EQTCJsKyh8QJ1qdLimvCmvo0dwOXxu_7yRjYBb0QU_6t969yqpvrNId-NNF-kMDA-WTO-gE1Sj-ACp5ghfqU-7y4cdpknINiCZgswTyLjzYTgKeDQFNFhYKZF7D0Eb5n8iSvqkIRYk42MRVcBek9waTVORqxge6_tup-YkdXqiWA", "comment": "Diabetes is difficult for veterans "}, {"profile_link": "/dianasbulbinella.enhoodia/?refid=52&__tn__=%7E-R", "datetime": "17 hrs · ", "content": "REVIEW OCOTEA: for more than JUST weight loss ☘️ \"Frequently Asked Questions\" about OCOTEA WEIGHT LOSS DROPS ☘️F.A.Q: (Everything you wanted to know about OCOTEA) ►☘️Question 1: WHO CAN USE OCOTEA? A: All adults, and children over 16. Not safe for pregnant or lactating women. ►☘️Question 2: WHAT DOES OCOTEA HELPS FOR? A : \"OCOTEA: for more than JUST weight loss.\" •Appetite suppressant •Curbs cravings •Detox •Fat burning •Anti-stress •Anti-cancer •Diabetes •Menopause •Antioxidant •Anti inflammatory •Anti irritation •Cholesterol •Lowers blood pressure •Improves metabolism •Improves functioning of metabolic enzymes •stabilizes & lowers blood sugar levels •safeguard body from insulin related problems •Anti blood clotting •Antibiotic •Fibromyalgia •anti-fungal •anti-microbial properties •Promotes proper food digestion •Anti acidity •treats foot fungus •Helps with hair loss, dandruff •Skin irritations •Cures candida, parasites, streptococcal •local anaesthetic •instant relief from headache •mental relaxation •Anxiety disorder •improves the functioning of cardiovascular system. ►☘️Question 3: WHAT DOES OCOTEA CONSIST OF? A: 100% Natural Ocotea oil. Ocotea oil is steam distilled from the leaves of the Ocotea tree. Ocotea trees grow in Ecuador. ►☘️Question 4: IS THIS PRODUCT APPROVED BY THE MEDICAL & HEALTH INSTITUTE? A: No, it is a 100% herbal and natural product. It is absolutely the clients own decision to follow the pharmaceutical route, or the natural route. Our product has absolutely no side effects, and can be successfully used with or without current prescription medicines. ►☘️Question 5: HOW DOES ONE USE OCOTEA? A: Different ways of taking OCOTEA: (choose of 1 or 2 or 3) 1. Take 2 drops 3x per day with water / iced tea. 2. Buy 100's Empty Capsules @ R65. Drip 4 drops OCOTEA in each capsule, and take 1x capsule in morning and 1 capsule at night. 3. Apply 1 drop 3x per day inside navel. ***For sensitive skin: first apply a little bit of Bulbinella cream (or any other Diana's cream), and then apply Ocotea. 4. Ocotea can also be applied directly onto skin, to treat Shingles, stubborn cellulite and also to lose centimetres. ►☘️Question 6: IS IT ONLY FOR PEOPLE WHO WHAT TO LOSE WEIGHT? A: No, also for the following conditions: •Anti-stress •Anti-cancer •Diabetes •Menopause •Antioxidant •Anti inflammatory •Anti irritation •Cholesterol •Lowers blood pressure •Improves metabolism •Improves functioning of metabolic enzymes •stabilizes & lowers blood sugar levels •safeguard body from insulin related problems •Anti blood clotting •Antibiotic •Fibromyalgia •anti-fungal •anti-microbial properties •Promotes proper food digestion •Anti acidity •treats foot fungus •Helps with hair loss, dandruff •Skin irritations •Cures candida, parasites, streptococcal •local anaesthetic •instant relief from headache •mental relaxation •Anxiety disorder •improves the functioning of cardiovascular system. ►☘️Question 7: CAN I USE IT WITH PRESCRIPTION MEDICINE? A: Yes. It is advised to take Ocotea 2 hours before or after your prescription medicines. ►☘️Question 8: WILL IT HAVE SIDE EFFECTS WITH THE PRESCRIPTION MEDICINE I AM ON? A: No. It is advised to take Ocotea 2 hours before or after your prescription medicines. ►☘️Question 9: WILL IT MAKES ME FEEL LIKE A ZOMBIE? A: No. ►☘️Question 10: IS IT ADDICTIVE- / HABIT FORMING? A: No. ►☘️Question 11: WILL I HAVE WITHDRAWAL SYMPTOMS IF I STOP USING THE PRODUCT? A: No. ►☘️Question 12: IF I WANT TO LOSE WEIGHT, CAN I CONTINUE TO EAT UNHEALTHY FOODS? A: No, to effectively lose weight one needs to change your unhealthy lifestyle choices. (More about this topic in question 14.) ►☘️Question 13: HOW LONG AFTER 1st STARTING USING OCOTEA WILL I NOTICE A DIFFERENCE? A: As from day 1 you will notice an immediate change in the way you feel. As you stay committed to positive lifestyle choices, you will reap the benefits. ►☘️Question 14: ARE EATING AND DRINKING PATTERNS IMPORTANT? A: Yes. I am of very FIRM BELIEVE that weight has everything to do with our habits & lifestyles!!!! Here is a few tips: •Don’t eat irregularly (eat in a fixed routine, every day, on the same times, and same portion sizes) •Always eat breakfast •Never overeat •Never eat too little •Never nibble continuously on foods / snacks •Never eat after 18h00 at night (no snacks after 18h00) •NO sugar (or any food or drink containing sugar) •NO Starches what so ever! •Drink STILL water every day (4-8 glasses) •NO alcohol •NO milk or sugar in tea/coffee •Max 2 fruit per day, eat it with a meal. •NO fruit juices •Max 500ml sugar free beverages (Coke zero, Sprite zero……) •Stress will hamper your efforts to lose weight •Chronic illnesses can hamper your efforts to lose weight •Emotional problems can hamper your efforts to lose weight •Certain vitamin supplements contain too much sugar. READ labels. Should you concentrate on these facts, and realize that the ONUS rest upon you to effectively change your habits and lifestyle, you will start to lose weight!!! NO WEIGHT LOSS PRODUCT CAN RECTIFY UNHEALTHY HABITS AND LIFESTYLE CHOICES ►☘️Question 15: WHEN I REACH MY GOAL WEIGHT AND STOP USING OCOTEA, WILL I GAIN WEIGHT AGAIN? A: YES and NO! YES: If you return to your unhealthy lifestyle, and repeatedly eat and drink unhealthy foods and drinks, you will most definitely gain weight again. NO: If you stay committed to continue to live a healthy lifestyle, make wise decisions when eating your meals, you will NOT gain any weight again. ►☘️Question 16: PRICE? 10ml R220 (10ml lasts 1 month when taking 2x drops 3x per day) 100ml R1760 ►☘️Question 17: DOES OCOTEA HAVE A LIMITED SHELF LIFE? A: No ☘️HOW TO ORDER: Diana Herbst 074 111 0315 diana.dhd@gmail.com ☘️Business hours:: Mon-Th: 8h00-15h30 Fri: 8h00-12h00 Sat-Sun: closed. Public holidays : closed", "likes": "5", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=3593446010667170&refid=52", "shares": "", "postid": "3593446010667170", "postlink": "https://m.facebook.com/story.php?story_fbid=3593446010667170&id=854216271256838&__xts__%5B0%5D=12.AbrQ4Yt3VgvqqrFBZtIffcGFyNrjDYOea0wZ3LqWmIN8rnBtxDIC8ow2JKZzovNoAq_4b3AQb0CSOe16k1oJfVpR_PRdMiloy85bH20sXiHdopi5AsIKRHoC_n2d_dmGK-24D2dr6OK2BOn-E6w4ZfTaWBhgwwlDuVnTwBbSLphh4D9I_dIDdiIVGerRDgfPFRKDjHZFD-b4Ce45Zk_Xepd3vwnAXmetXEhXFnk4EurNn6So5__aL3RjTeDG4LbjhoYXCQnVMwOBJqXxMU0Wyu1m_wpMDbt0CyHYQw7mrXKx6u34uK9rLcCVTh1zmcjpJ7g", "comment": "Eating with diabetes is an impact on your life."}, {"profile_link": "/story/view/?bucket_id=1521375364657252&exit_to_referer=1&viewer_session_id=3eff442f-360b-47a1-9fab-7aa0bff7b84a&source=post_header_actor_photo&refid=52&__tn__=-R", "datetime": "17 hrs · ", "content": "In case your body has become insensitive to insulin, here are few tips that can help you increase the sensitivity.", "likes": "4", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=4235354619870064&refid=52", "shares": "", "postid": "4235354619870064", "postlink": "https://m.facebook.com/story.php?story_fbid=4235354619870064&id=625194520886110&__xts__%5B0%5D=12.AboRx0aGml6NLJm6NdCUg2LvsPJqUCqqPp0IOGVKHc9Qxq6EP1oFBbHpaqFKTv9SeF-ZYjYp36b6pUxRBAi_7V0DXjb4aqs72MiU1coYz4WjQ67Z7LNlbHi119kl473kpntocowjAM8l9j9tNSoGplG7M9_hDtP7zlYzPaM5f6dwYqYplTOO8IZY_uU3VaCZmtO7e4c3RvJ3EKXgDP_ViFSgevEz_sXkx40RPEfm_4mtEkMX80hOXDr40U1h-oaXMHArhFTtBaQPLZlsMS-pqeGcxU_YyOWHqn-FJLHMFdR5CfW40o4ofeL77uxZwSEZKV8", "comment": "Insulin is expensive, but it's coming. You guys give us hope."}, {"profile_link": "/devinalexander/?refid=52&__tn__=%7E-R", "datetime": "23 hrs · ", "content": "#ad I love sandwiches because you can literally put anything in them! A personal favorite? My California Cobb chicken sandwich, packed w/ ingredients like avocado, grilled chicken, and even bacon. This diabetes friendly recipe is the perfect quick and easy lunchtime option. After lunch, don’t forget to check your glucose levels w/ the FreeStyle Libre 14 day system. The painless1 one-second scan w/ your smartphone* or reader allows you to get up-to-the-minute glucose readings so you have more time to do what you love – like cook. Full recipe is on Abbott FreeStyle, go check it out! Abbott #TeamFreeStyleLibre #FreeStyleLibre14daysystem *The FreeStyle LibreLink app is only compatible with certain mobile devices and operating systems. Please check the website for more information about device compatibility before using the app. 1Haak, Thomas, et al. Flash glucose-sensing technology as a replacement for blood glucose monitoring for the management of insulin-treated type 2 diabetes: a multicentre, open-label randomised controlled trial. Diabetes Therapy 8.1 (2017): 55-73 Visit www.freestylelibre.us/safety-information.html for safety information.", "likes": "11", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=10164178517890217&refid=52", "shares": "", "postid": "10164178517890217", "postlink": "https://m.facebook.com/story.php?story_fbid=10164178517890217&id=499189265216&__xts__%5B0%5D=12.AbrrxDBrGPYuEr3mhjTQL7KAGJAAJSmZr6l10r3e-OP08iQMDiJIiNGdn5GApn0t5LU4ZHwW7QJIq3KktYrRzS38Yt6K4p3AlNWmoh1PiuyqDA1HZDVaD70r0MdoZe3e3o57_ivjebF0L4PqxPA2BsfDMfV73gCB5ezSsGotquQquvoBYXQ_0XUa_c2uhMuELpmowUCczP27qx7tIyKrU0Pcqtn8YQhxJCiY7dO72-W8FKHdcRq_hdTj9Chq1fuayyJKMnlj9h4jLobiLe9Moh7iYOWGTnwypE1Xl_lfA-xvQPwH7re4tFN4Hedr8Xf-FfA", "comment": "Eating with diabetes is a way to save money on your medications."}, {"profile_link": "/TheDiabetesSite/?refid=52&__tn__=%7E-R", "datetime": "18 hrs · ", "content": "Which insulin type does your personality most closely match? Find out.", "likes": "4", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=3794402210591834&refid=52", "shares": "", "postid": "3794402210591834", "postlink": "https://m.facebook.com/story.php?story_fbid=3794402210591834&id=317342954964461&__xts__%5B0%5D=12.AbqUG_q0kA-QQdJiinkekVTSZqUM1rIuwGW0iOp8K9Gzz7VEwNHRtsjz3FTFt4YTuQgfmYUms6BpqS7Du8G15EL7OGepNQaosZCra1SNAd7tw32K5K_Y9coo7s7xlF2ZrdnypAl4s6Dan8z8p1dL5vNDLzuvsT3j3KvEJA1EA_XXy8-r4lxdB87t8_67F2GcpSyeYQzO4EG0iqYKLNdY2ee-uws8gMxaVZNdlDqbnn-WW31ONaaxo-YI2GCAvlF1NlzsWl-A0uZrJpu2RxH7WrW43G982Z2PNq5BFLxwvIGV-b5rQ9mLZ_QgoXr2q9h-1_8", "comment": "Insulin is one of all the worst expensive meds in the world"}, {"profile_link": "/speakforhealth/?refid=52&__tn__=%7E-R", "datetime": "20 hrs · ", "content": "Diabetic Peripheral Neuropathy ( DPN) is the most common complication of diabetes. Its onset is generally insidious & without treatment, the course is chronic & progressive. The loss of small fiber mediated sensation results in the loss of thermal & pain perception, Whereas large fiber impairment results in loss of touch & vibration perception. Peripheral Neuropathy can result from traumatic injuries, infections, metabolic problems, inherited causes & exposure to toxins. One of the most common causes is diabetes. People with Peripheral Neuropathy generally describe the pain as Stabbing, Burning or Tingling. Disclaimer:-  This is a patient awareness initiative issued by Speak Health in the public interest. The views and opinions expressed by the doctor are his own and are not meant to substitute any patient-specific medical advice. #FreedomfromPain #Speakhealth #healthcare #neurology", "likes": "5.6K", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=1535440499982481&refid=52", "shares": "3 Shares", "postid": "1535440499982481", "postlink": "https://m.facebook.com/story.php?story_fbid=1535440499982481&id=622769911249549&__xts__%5B0%5D=12.Abo2c1x_ANBCavWKomsfUs2LAqPxi3FigwR4deWRvf_QTfWyjI2jlSE0OncejvneWwqcZdgI3Wt6rgdGtOVCIqV8qGBzDAc1vlZRwH2YnrwhFmKv36pE5vFQz18Kd-y2ETAc9pYIdqHr70hev3zwE--PDt8WCk6aEZ5SRu7f1nlcayPM4Q5b2JmwfAWM1CYesNJEPg1A7JJ_buWdUUXNlqKQKQ-2NsgJR2t_b2vYL1yijU0-QQky6VRHVj_BCQThDuhE5kJoPrGvDuCnu5TzRPPcEbh0B9vIRouEychEqLrGl8feDwzCv0SxcBfZyeJFVwg", "comment": "Diabetes is a long-term disease that can be a illness that can be a mental health problem."}, {"profile_link": "/plastikosclinic/?refid=52&__tn__=%7E-R", "datetime": "14 hrs · ", "content": "Diabetic foot is a complex issue to offer a solution once an ulcer sets in. Besides insufficient blood supply and neuropathy, there are few predictive signs of a future diabetic ulcer, like callosity, hyperkeratosis, corn, fungal infections, hammer toe deformity, prominent ball of great toe or previous history of toe amputation. In such cases preventive surgeries can avoid frequent occurrence of such ulcers and help preventing amputations. #diabetes, #deformity, #disability, #charcoatfoot, #charcoatjoint, #diabeticfoot, #diabeticulcer, #ulcer, #neuropathy, #callosity, #hyperkeratosis, #corn, #fungalinfection, #hammertoedeformity, #prominentballofgreattoe, #amputation", "likes": "5", "likes_link": "https://m.facebook.com/ufi/reaction/profile/browser/?ft_ent_identifier=142614147499804&refid=52", "shares": "1 Share", "postid": "142614147499804", "postlink": "https://m.facebook.com/story.php?story_fbid=142614147499804&id=100346645059888&__xts__%5B0%5D=12.Abq2eZ9a8gEzysrW9HI976BNxwdDVf6UhticunuSp2xQVbCchCGERwy9WPX6ncjUdGAoze1DEYv9Va_BGQhEFC3KYpzQxnTo2JbnH3m2ptCfkhbQY7FUfm5ZXL1rhDYMy04LZFK0FfxY-66bQLK95pQYQfqi5HDJn072U7Kq0kDLjxzXFDGb35jYbrd3sU0K9Ow0DmooExnbN9p4dfnL2ofhPwFneyf59Y6_CywSgec8cjrpGGVW-hbVmkbo8noX7kgyIgshi4efKdJHDHkeM-ws673h_4OA_HYy3mDSWHYYG9oB_XipdEqCf6ycBcBwNqI", "comment": "Diabetes is a problem that makes you more likely to be taking meds."}]